In [1]:
from IPython.display import display, HTML
display(HTML("<style>.container { width:85% !important; }</style>"))

In [2]:
import pandas as pd
from sqlalchemy import create_engine

In [3]:
engine = create_engine('postgresql://root:root@localhost:5432/ny_taxi')

In [4]:
engine.connect()

Q1: How many taxi trips were there on January 15?

In [6]:
query = """
SELECT
    COUNT(1)
FROM
    yellow_taxi_trips
WHERE
    DATE(tpep_pickup_datetime) = DATE('2021-01-15')
"""

In [7]:
pd.read_sql(query, con=engine)

   count
0  53024

Q2: Largest tip for each day

In [8]:
query = """
SELECT
    tpep_pickup_datetime,
    tip_amount
FROM
    yellow_taxi_trips
ORDER BY
    tip_amount DESC
LIMIT
    10
"""

In [9]:
pd.read_sql(query, con=engine)

  tpep_pickup_datetime  tip_amount
0  2021-01-20 11:22:05     1140.44
1  2021-01-04 16:04:51      696.48
2  2021-01-03 11:36:52      369.40
3  2021-01-04 14:49:43      333.00
4  2021-01-26 18:32:33      250.00
5  2021-01-09 11:54:03      230.00
6  2021-01-19 10:17:02      200.80
7  2021-01-30 10:04:19      199.12
8  2021-01-12 12:57:36      192.61
9  2021-01-21 20:51:05      166.00

Q3: What was the most popular destination for passengers picked up in central park on January 14? Enter the zone name (not id)

In [16]:
query = """
SELECT
    "DOLocationID",
    COUNT(1)
FROM
    yellow_taxi_trips
WHERE
    "PULocationID" = 43
    AND DATE(tpep_pickup_datetime) = DATE('2021-01-14')
GROUP BY
    "DOLocationID"
ORDER BY
    count DESC
"""

In [17]:
pd.read_sql(query, con=engine)

    DOLocationID  count
0            237     97
1            236     94
2            142     83
3            238     68
4            239     60
..           ...    ...
72           254      1
73           257      1
74            62      1
75           220      1
76            25      1

[77 rows x 2 columns]

Q4: What's the pickup-dropoff pair with the largest average price for a ride (calculated based on total_amount)?

In [18]:
query = """
SELECT
    "PULocationID",
    "DOLocationID",
    AVG(total_amount) AS average
FROM
    yellow_taxi_trips
GROUP BY
    "DOLocationID",
    "PULocationID"
ORDER BY
    average DESC
"""

In [19]:
pd.read_sql(query, con=engine)

       PULocationID  DOLocationID   average
0                 4           265  2292.400
1               234            39   262.852
2               177           265   234.510
3               145            48   207.610
4                25           260   200.300
...             ...           ...       ...
27733           128           128     0.000
27734           148           173    -7.000
27735            28           253   -32.500
27736            68           192   -43.800
27737           186           124   -54.800

[27738 rows x 3 columns]